Tekla Open API Reference for Tekla Structures 2025
RebarSplice.Offset Property
 The distance from the end point of the first bar along the bar length.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Offset { get; set; }
Public Property Offset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace